[

    {
        "title": "Sassy",
        "projectType": "A Bootstrap like SCSS Framework",
        "description": "<h4>What is it?</h4><p>Sassy is an style framework similar to Bootstrap. It can be imported into any front-end web project for quick and easy styling. This website is documentation on how to use the style framework and was build with this style framework. Sassy helps the user align items on the screen in a grid based system as well as restyle elements.</p><p>This framework is made for the user's convenience. It allows users to create more complex elements with ease, such as nav bars, dropdowns, modals, alerts, and tooltips.</p><h4>The Technical Side</h4><p>Sassy was build in SCSS, which was compiled down to CSS. This documentation for Sassy was build using itself as a way to show off how it works and its simplicity. The documentation shows an example and code for each element and layout in Sassy.</p><h4>What I Learned</h4><p>This project was my introduction to a CSS extension language. It helped me learn how and why to use SCSS as well as make me think of all of the ways I could make standard styling easier for users.</p>",
        "images": ["alignment.png", "btngroup.png", "slideshow.png"],
        "imageLayout": "layout3a",
        "coverImage": "cover-image.png",
        "githubLink": "https://github.com/RUnroe/Scss-Framework",
        "liveSiteLink": "",
        "primaryLanguage": "SCSS",
        "languageColor": ["#ffffff", "#7165AD"]
    },
    {
        "title": "Ascension",
        "projectType": "A video game renting and tracking website",
        "description": "<h4>What is it?</h4><p>Ascension is a website that allows users to keep track of their video games. It lets them add and remove games within their library and then gives the ability to filter and search for games. Once games are in the library, they can be rented out to friends. Ascension keeps track of who a game is rented out to and when it was rented out.</p> <p>Ascension was created as a final project for a class at Neumont College of Computer Science.</p><h4>The Technical Side</h4><p>Ascension was built as an ASP.NET MVC (model view controller) application. It uses sessions and a local SQL Server database to allow multiple accounts to use the site and persist their data. The pages were styled with custom CSS and Bootstrap.</p><h4>What I Learned</h4><p>This was one of my first projects in ASP.NET, so there was a lot for me to learn. Throughout this project, I reinforced my knowledge on how to create a basic ASP.NET MVC application while also learning how to integrate with database using roles, migrations, and model binding.</p>",
        "images": ["app.png", "cover-image.png", "filters.png"],
        "imageLayout": "layout3a",
        "coverImage": "cover-image.png",
        "githubLink": "https://github.com/RUnroe/VideoGameLibrary",
        "liveSiteLink": "",
        "primaryLanguage": "ASP.NET",
        "languageColor": ["#ffffff", "#4A46E2"]
    }

]